Repository: h53d/babylonjs-doc-cn
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The first is to define a collection of keys and defining your object's situation at each key.
zh_cn: 第一种方式是定义一系列的键值集合，并且定义好每个键值对应的对象物状态。

source: The next is cannon.js - an optional physics 'engine' that allows WebGL shapes (meshes) to act like real life objects.
zh_cn: 下一个是 cannon.js - 一个可选的物理 '引擎', 其使WebGL里的造型(网格)的行为像真实生活里的物体对象.

source: The other common type of 'pocket' on a Javascript object... is called a 'method' (sometimes called a 'function').&nbsp; Methods are used to store Javascript code onto Javascript objects.&nbsp; Earlier, I said that properties are 'set'.&nbsp; Well, methods are 'called'.&nbsp; Here is the way a method is 'called'.
zh_cn: Javascript对象里另外的'存储空间'常见''类型叫做'方法'(有时叫做 '函数').&nbsp; 方法用来讲Javascript代码存储到Javascript对象里.&nbsp; 早些时候,我说的'set'属性也是个方法.&nbsp; 嗯, 方法是被'调用'的.&nbsp; 这儿是个方法被'调用'的方式.

source: The second way is for more complex animations, when you change animation code at run time.
zh_cn: 第二种方式可以定义更复杂的动画，在运行是改变动画代码。

source: The speed ratio of this animation optional | onAnimationEnd | () => void | The function triggered on the end of the animation (also dependent upon ANIMATIONLOOPMODE) optional | animatable | [Animatable](http://doc.babylonjs.com/classes/Animatable) | An optional specific animation ---
zh_cn: 动画的速率 可选 | onAnimationEnd | () => void | 该函数在动画的结束被触发调用(同样取决于 ANIMATIONLOOPMODE) 可选 | 可播放 | [Animatable](http://doc.babylonjs.com/classes/Animatable) | 一个可选的特殊动画 ---

source: The three 'parameters' inside the parentheses of a Vector3 value... are floats.&nbsp; They can be negative or positive, and there is no practical limit to the size of those values.&nbsp; Let's look at a Vector3 being used to set the .position of a mesh.
zh_cn: Vector3值的括号里三个'参数'是浮点类型的.&nbsp; 它们可正可负, 这些值并没有实际大小的限制.&nbsp; 让我们看个使用Vector3给网格对象设置位置属性值的例子.

source: There are three possible values you can give for EasingMode: - ```BABYLON.EasingFunction.EASINGMODE_EASEIN``` : Interpolation follows the mathematical formula associated with the easing function.
zh_cn: 有三个值你可以用来赋给 EasingMode: - ```BABYLON.EasingFunction.EASINGMODE_EASEIN``` : 按照简化函数的数学公式来控制插入.

source: There are two primary ways of doing animations in your scene.
zh_cn: 有两种主要的方式实现场景动画。

source: There are two types of value objects that are very common in Babylon.js.&nbsp; They are the Vector3 value, and the Color3 value.&nbsp; Vector3 and Color3 values... deserve to have their own section in this giant tutorial.&nbsp; Here we go...
zh_cn: 在Babylon.js中有两类十分常见 的值类型.&nbsp; 它们是三元向量(Vector3)值和3元颜色( Color3)值.&nbsp; Vector3和Color3 values...保留着，后面各自有章节讲有.&nbsp; 我们继续此处的内容....

source: There is a tutorial for the Babylon.js playground.&nbsp; Just [**click here**](http://doc.babylonjs.com/page.php?p=22631).
zh_cn: Babylon.js 娱乐展示厅有个教程.&nbsp; 就在 [**点击这儿**](http://doc.babylonjs.com/page.php?p=22631).

source: There, you can start a new topic, tell everyone the URL to your broken playground createScene function, and ask others if they will please visit your playground scene and help you get it working correctly.&nbsp;
zh_cn: 在那,你可以开始一个新的话题, 将破坏你娱乐展示场景的createScene函数网址告诉大家, 问下是否有人乐意访问你的娱乐展示场景并帮助你修正.&nbsp;

source: These commands will apply to every animation object contained in the Animatable's ._animations array.
zh_cn: 这些指令将应用到包涵在 _animations 数组里的每个动画对象上.

source: This blended animation will interpolate FROM the current object's state.
zh_cn: 被渲染了的动画将被添加到当前对象状态上.

source: This can be any mesh property, depending upon what you want to change.
zh_cn: 这个可以是网格的任何属性，取决于你要修改什么。

source: This function can be very useful for complex animation like games, where characters have to move depending on many parameters.
zh_cn: 这个函数对复杂动画特别有用,比如一些游戏里角色的移动必需依赖于许多参数.

source: This function returns a ```BABYLON.Animatable``` object that you can use to get access to individual animations (for instance using ```getAnimationByTargetProperty``` function).
zh_cn: 这个函数返回一个 ```BABYLON.Animatable``` 对象,通过该对象能够访问个别的动画 (例如使用 ```getAnimationByTargetProperty``` 功能).

source: This is called white-boarding.&nbsp; It is an easy way to allow many people to work on your createScene function and help you figure out what is wrong.&nbsp; See how the createScene function is 'portable'?&nbsp; You took it from your home, to the playground, then played with it there for awhile.&nbsp; Then, if needed, you clicked the playground's **SAVE** button, which gave it a URL.&nbsp; &nbsp;Then you went to the forum and showed that URL to others, and asked for their help.&nbsp; Handy, huh?&nbsp; We think so.
zh_cn: 这就是所谓的白板.&nbsp; 它使得其他人能很容易的在你创建的场景上工作, 并帮你指出错误之处.&nbsp; 清楚了创建场景函数是如何'可移植'了么?&nbsp; 从家里获得, 扔到娱乐展示厅, 然后在上面折腾一阵.&nbsp; 如果有必要, 你可以点击娱乐展示厅上的 **保持** 按钮, 产生一个网址.&nbsp; &nbsp;最后到论坛上讲网址告诉其他人, 向他们求助.&nbsp; 很方便吧, 哼??&nbsp; 我们认为是这样的.

source: This time, I would like you to press the **Get .zip** button.&nbsp; The playground will open a small panel allowing you to download this scene.&nbsp; Save the zip file in some new empty folder on your home computer.&nbsp; Now use an UNZIP utility program to unzip it.&nbsp; Notice that there is one file in the folder, called index.html.&nbsp; Please load that file into a text editor or programming editor.&nbsp; Does it look like the big picture above?&nbsp; Sure it does.&nbsp; ANY scene from the Babylon.js playground, including its pre-installed demo scenes, can be brought to your home with the **Get .zip** button.&nbsp; Most of them will look very similar to the big picture, above.
zh_cn: 这次,我希望你按下 **获取zip压缩包** 按钮.&nbsp; 娱乐展示厅将打开一个小面板让你下载该场景.&nbsp; 保存这个zip压缩文件到你家里电脑上某个新的空文件夹下.&nbsp; 现在使用一个 UNZIP 工具程序解压开.&nbsp; 注意那个文件夹下有一个index.html文件.&nbsp; 请将该文件用文本编辑器或编程用 编辑器打开.&nbsp; 它看起来像上面的大图片吧?&nbsp; 必需的.&nbsp; Babylon.js 娱乐展示厅的任何场景, 包括它里面预装的演示场景, 都可以通过 **获取.zip压缩包** 按钮下载到你家里的电脑上.&nbsp; 其中的大部分看起来都非常像上面的大图片.

source: This would be handy for user-controlled walking characters, or reacting to value changes from an input device.
zh_cn: 这会对用户很方便 - 例如:控制行走中的角色, 或者实时响应来自输入设备的数据值变化.

source: To achieve today’s animated scene, we begin by creating our environment:
zh_cn: 为了实现今天的动态场景，我们开始创建自己的环境：

source: To be able to use this function, you need to know that : - Your animation will have predefined key frames (Only 2 keyframes are generated : **Start** and **End**) - The animation works only on **AbstractMesh** objects.
zh_cn: 为了使用该函数,你需要知道这些: - 你的动画需要有预定义的关键帧 (仅有2个关键帧被创建 : **开始** 和 **结束**) - 这些动画仅在 **AbstractMesh** 对象上有效.

source: To be honest, a light is not an absolute requirement.&nbsp; If the mesh in a scene... all have a material.emissiveColor or material.emissiveTexture properly set, then they will each produce their own light.&nbsp; They will be 'self-illuminated'.&nbsp; Careful, it is easy to get lost in a scene without a light.&nbsp; Good advice would be to ALWAYS have one light (a HemisphericLight aimed to the sky, is a very handy wide-lighting tool).&nbsp; You can adjust its .intensity value to set its brightness.&nbsp; We have a tutorial in our Playpen Series... dedicated to talking about lights.
zh_cn: 老实说, 光源不是绝对必需的.&nbsp; 如果场景里的网格对象都设置了material.emissiveColor(材料的颜色)或material.emissiveTexture(材料的纹理)属性, 那么它们自己会产生各自的光.&nbsp; 它们将是 '自发光的'.&nbsp; 注意, 如果一个场景里没有光是很容易迷失的.&nbsp; 好的建议是总是创建一个光源(半球体光源(HemisphericLight)是个非常方便的灯光工具 - 应用到天空体上).&nbsp; 你可以通过调整它的 .intensity 值来设置光的亮度.&nbsp;在操练系列教程里我们有一个例子, 专门谈论各种光源.

source: To put dynamics in it, we are going to learn how to tell your computer to move your meshes in any way you choose.
zh_cn: 为了给它注入动态，我们将开始学习如何控制电脑来按照你指定的方式移动你创建的网格对象。

source: Two of the most-used values in Babylon.js, are Vector3 values and Color3 values.
zh_cn: Babylon.js里最常用的两种值是 Vector3 值和 Color3 值.

source: Values... are often the things that are stored in an object's properties ('pockets') and the things that are returned when GETTER methods are called.&nbsp; As crazy as this sounds, all values are Javascript objects.&nbsp; Remember that 0.5 float that we saw earlier?&nbsp; That is a Floating Point&nbsp; NUMBER OBJECT.&nbsp; The 'box_I_made' variable above... it is a MESH OBJECT.&nbsp; The names of mesh, cameras, and lights... are STRING OBJECTS.
zh_cn: 值... 通常是存储在对象的属性(存储空间)里的内容, 而且可以通过调用 GETTER 方法获取到.&nbsp; 也许听起来这很疯狂：所有值都是Javascript对象.&nbsp; 还记得前面看到的那个0.5浮点数吗?&nbsp; 那是个数值对象.&nbsp; 上面那个 'box_I_made' 变量... 它是个网格对象.&nbsp; 网格，像机和灯光的名称 是字符串对象.

source: Watch this positioning demo scene for some time, if you please.&nbsp; It will not take long for you to completely understand mesh positioning.&nbsp;
zh_cn: 如果你乐意, 请多花些时间看这个关于位置属性的演示场景.&nbsp; 要不了多久你就会完全理解网格定位了.&nbsp;

source: We have now completed an Animation for box1.scaling.x.
zh_cn: 现在我们已经完全实现在x轴方向缩放 box1 的动画.

source: We hope to teach you a large amount of information in a very quick manner.&nbsp; Often there are more ways than one to accomplish a task here.&nbsp; I will let you discover those other ways by yourself.&nbsp; For now we will teach you the quickest and easiest ways, determined by studying the traits of other new users of Babylon.js.
zh_cn: 我们希望以一种非常快速的方式教给你大量的信息.&nbsp; 通常这里的任务都有多于一种方式达成.&nbsp; 我希望你自己去发现其它的方式.&nbsp; 根据对Babylon.js初学者特点的研究, 现在我们教你最快最简单的方式.

source: Welcome to The Babylon.js Primer, an introduction to some of the things you will need to know in order to get the most out of this useful Javascript-based WebGL framework.
zh_cn: 欢迎阅读 Babylon.js 初级教程, 这是后面学习最棒的基于Javascript的网页图形库框架所需必备知识的一个基础介绍.

source: What is a framework, you ask?&nbsp; You can think of a framework as scaffolding for a building, allowing you to build around it without worrying about the foundation.
zh_cn: 你想知道什么是框架么?&nbsp; 你可以把框架认为成 建筑里的脚手架, 它支撑你围绕它创建新东西而不必为底层细节操心.

source: When you click Get .zip at the Babylon.js playground, you get a zip that contains a file called index.html.&nbsp; If you examine index.html in a text editor, you will see a file that looks very much like The Big Picture far above.&nbsp; Look at the external includes section... the first four HTML SCRIPT elements/tags.&nbsp; The .src attribute within each of those SCRIPT elements... point to URL's located at the Babylon.js web site.
zh_cn: 当你在娱乐展示厅里点击获取.zip时, 你得到一个zip压缩文件其中包含个叫做index.html的文件.&nbsp; 如果你在文本编辑器中查看这个index.html文件, 你将看到一个和上面大图里非常像的文件内容.&nbsp; 查看下外部包含的段落... 第一批4个页面SCRIPT元素/标签.&nbsp; 每个标签里的.src属性... 指向里Babylon.js网站的网址.

source: Wow, this is a lot of information, isn't it?&nbsp; You have learned what a scene file (the big picture) looks like, you have learned about its important createScene() function and how copy'n'paste portable it is.&nbsp; You have seen a createScene() function in the Babylon.js playground, and you have been introduced to the playground's RUN, SAVE, and Get .zip buttons.
zh_cn: 哇, 到这儿信息量很大了,不是吗?&nbsp; 你已经学了如何识别一个场景文件 (大突破) 了, 学了它重要的 createScene() 函数, 而且学了怎么复制粘贴它到别处.&nbsp; 你已经见识了娱乐展示厅里的 createScene() 函数, 而且为你介绍了它的 运行, 保存 和 获取.zip压缩包的按钮.

source: You are becoming a Babylon.js TOOLS expert.&nbsp; When I say 'tools', I mean... you have learned the things that SUPPORT the createScene() function.&nbsp; Are you ready to engage in learning some things about the code that is used in a createScene() function?&nbsp; I knew you were.
zh_cn: 您正在成为Babylon.js工具专家.&nbsp; 我所说的 '工具', 是指... 那些你学到的支持 createScene() 函数的东西.&nbsp; 你已经准备好加入学习代码知识,以用在创建场景的功能么?&nbsp; 我知道你准备好了.

source: You are finally at the bottom of this tutorial.&nbsp; It was a long, but fun trip, wasn't it?&nbsp; Things will be easy from now on.&nbsp; The next tutorial in the Playpen Series tutorials... is about building a very basic scene.&nbsp; I think it will be quite easy and fast, for you.&nbsp; You have graduated from tutorial #0... this tutorial.&nbsp; You are already a Babylon.js expert.
zh_cn: 你终于到达这个教程的底部了.&nbsp; 它很长, 但是很有趣, 不是么?&nbsp; 从现在开始将很容易的.&nbsp; 下一演练系列的教程里... 是关于常见一个非常基础的场景的.&nbsp; 我想对你而言,它会非常简单而且快; 你已经从本教程#0毕业啦... &nbsp; 你已经是个Babylon.js专家啦.

source: You can add some behaviors to your animations, using easing functions.
zh_cn: 你可以使用简化函数给动画添加一些不同的行为.

source: You can also get access to current running ```BABYLON.Animatable``` objects by using ```scene.getAnimatableByTarget()``` providing the target object.
zh_cn: 通过提供目标对象来调用 ```scene.getAnimatableByTarget()``` 你也可以访问当前正在运行的 ```BABYLON.Animatable``` 对象.

source: You can learn many more things about Babylon.js scenes... in the other [tutorials and documentation](http://doc.babylonjs.com/).&nbsp; And don't forget to look at the 'createScene()' functions of the playground's pre-installed demo scenes.&nbsp; The Babylon.js playground is a learning wonderland, and it is a whole lot of fun, too.
zh_cn: 关于Babylon.js的场景, 在另外的 [教程和文档](http://doc.babylonjs.com/)里你可以学到许多.&nbsp; 而且别忘了察看娱乐展示厅里 'createScene()' 函数的预装演示场景.&nbsp; Babylon.js的娱乐展示厅是个学习乐园, 也充满乐趣.

source: You can play with bezier curve algorithm too, using the **BezierCurveEase(x1, y1, x2, y2)** function.
zh_cn: 你也能用贝塞尔曲线的算法, 使用 **BezierCurveEase(x1, y1, x2, y2)** 函数.

source: You can use an extended function to create a quick animation:
zh_cn: 通过一个扩展函数你可以创建快速动画:

source: You can use the **EasingMode** property to alter how the easing function behaves, that is, change how the animation interpolates.
zh_cn: 你可以使用 **EasingMode** 这个属性来修改简化函数的行为, 也就是, 改变动画是如何插入的.

source: You could 'externalize' the entire green section, and possibly place it into a file called... 'myJavascript.js'... maybe in a folder called 'jsfolder'.&nbsp; Then you could remove the green section, and add one more EXTERNAL INCLUDE script element/tag that might look like this: ``` html <script src="./jsfolder/myJavascript.js"></script> ``` You need not concern yourself with that, at this point.&nbsp; Externalizing your Javascript is often done when you have written LOTS of Javascript code.&nbsp; Externalizing your code into separate files helps your project be organized, but it is not necessary this early in your webGL adventures.
zh_cn: 你可以把绿色部分外部化, 可以把它们放到一个叫做... 'myJavascript.js'文件里, 也许还在个叫做... 'jsfolder'的目录里.&nbsp; 然后你可以移除绿色部分, 且再添加一个外部包含 脚本 元素/标签, 看起来就像这样: ``` html <script src="./jsfolder/myJavascript.js"></script> ``` You need not concern yourself with that, at this point.&nbsp; Externalizing your Javascript is often done when you have written LOTS of Javascript code.&nbsp; Externalizing your code into separate files helps your project be organized, but it is not necessary this early in your webGL adventures.

source: You have seen some createScene functions, and you have noticed that much of the Javascript code used to make a Babylon.js scene... sets values on object properties.&nbsp; To illustrate what I mean:
zh_cn: 你已经见识了一些创建场景的函数, 而且你也应该注意到大量Javascript代码被用来创建Babylon.js场景... 给些代码阐述下我的意思, &nbsp;比如设置对象的属性值:

source: You may have noticed that scaling values are never negative.&nbsp; It would be illogical to use a negative scaling value, and if you decide to use some negative values, unexpected results may occur.
zh_cn: 你也许注意到了缩放值没有出现过负数.&nbsp; 使用负数值来缩放是非法的, 而且如果你决定使用负数值, 可能会出现未知异常.

source: You might want to open that playground scene in a new window or new tab, so you can switch back and forth between here and there.
zh_cn: 你也许希望在新的浏览器窗口或标签页来打开娱乐联系的场景, 那样可以通过后退和前进切换不同场景.

source: Your scene is now becoming dynamic, and all your meshes can move in all directions!
zh_cn: 你的场景现在动起来了, 你的所有网格都可在所有方向上移动!

source: [**babylon.js**](http://www.babylonjs.com/babylon.js)&nbsp; &nbsp;<= right-click... save link/target
zh_cn: [**babylon.js**](http://www.babylonjs.com/babylon.js)&nbsp; &nbsp;<= 右击... 保存链接/目标

source: [**cannon.js**](http://www.babylonjs.com/cannon.js)&nbsp; <= right-click... save link/target
zh_cn: [**cannon.js**](http://www.babylonjs.com/cannon.js)&nbsp; <= 右击... 保存链接/目标

source: [**hand.js**](http://www.babylonjs.com/hand.minified-1.2.js)&nbsp; <= right-click... save link/target
zh_cn: [**hand.js**](http://www.babylonjs.com/hand.minified-1.2.js)&nbsp; <= 右击... 保存链接/目标

source: [**oimo.js**](http://www.babylonjs.com/oimo.js)&nbsp; <= right-click... save link/target
zh_cn: [**oimo.js**](http://www.babylonjs.com/oimo.js)&nbsp; <= 右击... 保存链接/目标

source: _Final result_
zh_cn: _最终结果_

source: ``` It is difficult for me to explain, but actually quite easy to do, thanks to Babylon.js.&nbsp; Experimenting with properties and methods... is the fastest way to learn.
zh_cn: ``` 对我来而言，空说难但具体做起来很容易, 这要归功于 Babylon.js.&nbsp; 尽快熟悉属性和方法... 是最佳的学习途径.

source: ``` javascript // Create a BABYLON.Engine type of object.
zh_cn: ``` javascript // 创建一个 BABYLON.Engine 引擎对象类型.

source: ``` javascript // Creation of a triangular lines mesh var myLines = BABYLON.Mesh.CreateLines("itsName", [ &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(-5, 0, 5), &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(5, 0, 5), &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(0, 0, -5), &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(-5, 0, 5) ], scene);
zh_cn: ``` javascript // 三角线网格的创建 var myLines = BABYLON.Mesh.CreateLines("itsName", [ &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(-5, 0, 5), &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(5, 0, 5), &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(0, 0, -5), &nbsp;&nbsp; &nbsp;&nbsp; &nbsp; new BABYLON.Vector3(-5, 0, 5) ], scene);

source: ``` javascript box.position = new BABYLON.Vector3(0, 10, 0); ``` The xValue is 0, meaning that the box is positioned in the center of the x-axis.&nbsp; The yValue is 10, meaning that the box is positioned 10 units above the center of the y-axis.&nbsp; The zValue is 0, meaning that the box is positioned in the center of the z-axis.&nbsp; Easy.&nbsp; We will talk more about positioning... further below.&nbsp;
zh_cn: ``` javascript box.position = new BABYLON.Vector3(0, 10, 0); ``` 该 xValue 为是0, 意味着那个盒子位于X轴的中心.&nbsp; 该yValue值是10, 意味着那个盒子位于Y轴中心上方10个单位的位置.&nbsp; 该zValue值是0, 意味着那个盒子位于Z轴中心的位置.&nbsp; 简单吧.&nbsp; 在后面我们讲更多的讨论位置.&nbsp;

source: ``` javascript box.rotation = new BABYLON.Vector3(Math.PI/4, 0, 0); ``` Here, our box is being rotated around the x-axis... about 45 degrees.&nbsp; In Babylon.js, rotation is measured in radians.&nbsp; Math.PI/4 is approximately .707 radians.&nbsp; To rotate 90 degrees, it would be Math.PI/2, or about 1.57 radians.&nbsp; For 180 degrees, it would be Math.PI, or about 3.14 radians.&nbsp; To rotate 360 degrees, it would Math.PI times 2, or about 6.28 radians.
zh_cn: ``` javascript box.rotation = new BABYLON.Vector3(Math.PI/4, 0, 0); ``` 此处, 我们的盒子绕着X轴旋转呢来大约45度.&nbsp; 在Babylon.js里, 旋转是以弧度为度量单位的.&nbsp; Math.PI/4 约等于.707 弧度.&nbsp; 要旋转90度, 将是Math.PI/2, 或着说大约1.57 弧度.&nbsp; 对于180度, 是Math.PI, 或大约3.14 弧度.&nbsp; 要旋转360度, 那就是Math.PI 乘以2, 或者大约6.28弧度.

source: ``` javascript box.scaling = new BABYLON.Vector3(1, 1, 3); ``` Scaling is a way to shrink or stretch a mesh along any of the 3 scene axes.&nbsp; In the above example, the xValue (1) indicates that no scaling change to the mesh along its x-axis... is desired.&nbsp; The yValue of 1 indicates that we want no change in scaling along the y-axis, either.&nbsp; The zValue of 3 indicates that we we are 'stretching' our mesh along its z-axis... to 3 times its normal size.&nbsp; Easy, right?&nbsp; You bet!&nbsp;
zh_cn: ``` javascript box.scaling = new BABYLON.Vector3(1, 1, 3); ``` 缩放是种在场景3轴的任何方向上缩减或拉伸网格的方法.&nbsp; 在上面的例子里, 该xValue (1) 表明网格在X轴上没有缩放改变.&nbsp; 该yValue值1 表明也不要在Y轴上做缩放改变.&nbsp; 该zValue值3表明我们希望在Z轴上拉伸到3倍原大小.&nbsp; 简单吧, 这样就对了?&nbsp; 你矇对了!&nbsp;

source: ``` javascript box_I_made.rotation.y = Math.PI/2;&nbsp; // Rotate the box 90 degrees on the Y-axis.
zh_cn: ``` javascript box_I_made.rotation.y = Math.PI/2;&nbsp; // 在Y轴上旋转90度.

source: ``` javascript light.intensity = 0.5; ``` Here, we 'set' the property named 'intensity' on the object called 'light' to a value of 0.5 (0.5 is called a FLOATING POINT value, or just 'a float').&nbsp; We'll talk about values, shortly.&nbsp; The main thing I want you to notice is that the property (pocket) had a NAME... .intensity, and we stored the value 0.5 into that pocket (on the object named 'light').
zh_cn: ``` javascript light.intensity = 0.5; ``` 此处, 我们给一个被称为'光'的对象设置其叫做 'intensity'的属性值为0.5 (0.5 叫做浮点值, 或仅称为'a float').&nbsp; 我们后面简短的谈论下值.&nbsp; 我主要是希望你注意 那个具有intensity名字的属性(存储空间), 而且我们吧值0.5存到那里(属于那个称为'light'的对象).

source: ``` javascript myLight.diffuse = new BABYLON.Color3(0.5, 0, 0); ``` And there we go.&nbsp; We have colored the light beam that emits from our light... to be medium red.&nbsp; There is one more use for a Color3 value, and that is on one of our newest basic shape objects... called a LINES object.&nbsp; A LINES object does not use a StandardMaterial object for its color.&nbsp; It uses a property called .color.&nbsp; Here is an example of a LINES object being created, and then colored:
zh_cn: ``` javascript myLight.diffuse = new BABYLON.Color3(0.5, 0, 0); ``` 我们开始吧.&nbsp; 我们将光源发散出来的光线着色为中红色.&nbsp; 有不止一种使用Color3值的方式, 其中一种使用在来我们最基础的造型对象(线对象)上.&nbsp; 一个线对象不使用标准材质作为其颜色.&nbsp; 它使用一个称为颜色(.color)的属性.&nbsp; 此处我们有个例子创建一个线对象,然后为其着色的例子:

source: ``` javascript mySpotLight.direction = new BABYLON.Vector3(0, -1, 0); ``` Generally speaking, when a Vector3 value is used to set a DIRECTION, the xValue, yValue, and zValue are each in a range of negative 1... to positive 1.&nbsp; In the example above, our light is aimed negative on the y-axis... or... straight down.&nbsp; Directions (directional vectors) are used for more things than just lights, but lights is a common use.&nbsp; Directional vectors are not always easy things to determine the x, y, and z parameters/values for.&nbsp; We have some helpful tools on our lights... that will assist you in setting directions.&nbsp; You will learn about those tools in our lights tutorial.
zh_cn: ``` javascript mySpotLight.direction = new BABYLON.Vector3(0, -1, 0); ``` 通常来说, 当一个Vector3值被用来设置一个方向是, 该xValue, yValue, 和 zValue是在负1和正1之间的.&nbsp; 在上面的例子里, 我们的光是瞄向Y轴负方向的... 或者直接向下.&nbsp; 矢量 (方向向量) 被用在不仅仅是灯光上, 但通常是灯光上.&nbsp; 矢量并不总是能很容易的用x, y, 和z 为参数来衡量.&nbsp; 我们有些辅助工具来处理灯光... 它们将帮助你设置方向.&nbsp; 你讲在我们的灯光教程里来学习那些工具.

source: ``` javascript object.property = value; ``` Let's talk more about these four things... objects, properties, methods, and values.
zh_cn: ``` javascript object.property = value; ``` 让我们更深入的讨论这4个事情: 对象, 属性, 方法, 和 值.

source: ``` javascript scene.getMeshByName("box"); ``` Here, we have 'called' the getMeshByName() method that is located on the object called 'scene'.&nbsp; See that "box" thing inside the parentheses?&nbsp; That is called a 'parameter' or sometimes called an 'argument' or just... 'an arg'.&nbsp; Some methods require one or more parameters inside the parentheses, and some require none at all.&nbsp; If you look at your createScene function (method) from the big picture above, it had empty parentheses.&nbsp; It did not require any parameters in order to be called.&nbsp; At other times, you might see createScene(engine).&nbsp; In this case, the createScene method DOES require a parameter...&nbsp; a Javascript ENGINE-type of object.
zh_cn: ``` javascript scene.getMeshByName("box"); ``` 此处,我们调用了一个叫做'scene'的对象上的 getMeshByName() 方法.&nbsp; 看到括号里面的 "box" 了么?&nbsp; 那是一个 '参数' 或者有时也叫做一个 '变元' 或简化为 '一个arg'.&nbsp; 有些方法需要一个或多个参数在括号里, 而且有些压根不需要参数.&nbsp; 如果你从上面的大图里查看下创建场景的函数(方法), 你会发现它的括号里是空的.&nbsp; 调用一个函数并不必须提供参数.&nbsp; 另外一些时候,你可能看到createScene(engine)这样的调用函数.&nbsp; 这种情况下, 创建场景方法确实需要一个Javascript对象的引擎类型的参数.

source: ``` javascript var box_I_made = scene.getMeshByName("box"); ``` This call is getting a reference/handle on a box that was made earlier in the code, and putting that reference into a variable called 'box_I_made'.&nbsp; After you get that reference, you can do things to the box... like set property values.
zh_cn: ``` javascript var box_I_made = scene.getMeshByName("box"); ``` 这个调用获取了之前代码创建的盒子对象引用/句柄, 然后把它赋值给一个叫 'box_I_made'的变量.&nbsp; 你获得那个句柄后，就可以操作那个盒子了... 像设置属性.
